Tekla Open API Reference for Tekla Structures 2025
Color Constructor (Double, Double, Double, Double)
 Creates a new color object with the given values.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Color(
	double Red,
	double Green,
	double Blue,
	double Transparency
)
Public Sub New (
	Red As Double,
	Green As Double,
	Blue As Double,
	Transparency As Double
)
Parameters
Red
Type: System.Double
The red value of the color, between 0.0 and 1.0.
Green
Type: System.Double
The green value of the color, between 0.0 and 1.0.
Blue
Type: System.Double
The blue value of the color, between 0.0 and 1.0.
Transparency
Type: System.Double
The transparency value of the color, between 0.0 (completely see-through) and 1.0 (completely solid).
See Also
Reference
Color Class
Color Overload
Tekla.Structures.Model.UI Namespace